#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.cognito_create_auth_challenge_log_group will be created
  + resource "aws_cloudwatch_log_group" "cognito_create_auth_challenge_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/cognito_create_auth_challenge"
      + retention_in_days = 0
      + tags_all          = (known after apply)
    }

  # aws_cloudwatch_log_group.cognito_define_auth_challenge_log_group will be created
  + resource "aws_cloudwatch_log_group" "cognito_define_auth_challenge_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/cognito_define_auth_challenge"
      + retention_in_days = 0
      + tags_all          = (known after apply)
    }

  # aws_cloudwatch_log_group.cognito_pre_signup_log_group will be created
  + resource "aws_cloudwatch_log_group" "cognito_pre_signup_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/cognito_pre_signup"
      + retention_in_days = 0
      + tags_all          = (known after apply)
    }

  # aws_cloudwatch_log_group.cognito_verify_auth_challenge_log_group will be created
  + resource "aws_cloudwatch_log_group" "cognito_verify_auth_challenge_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/cognito_verify_auth_challenge"
      + retention_in_days = 0
      + tags_all          = (known after apply)
    }

  # aws_cognito_user_pool.cognito_user_pool will be created
  + resource "aws_cognito_user_pool" "cognito_user_pool" {
      + arn                        = (known after apply)
      + creation_date              = (known after apply)
      + custom_domain              = (known after apply)
      + domain                     = (known after apply)
      + email_verification_message = (known after apply)
      + email_verification_subject = (known after apply)
      + endpoint                   = (known after apply)
      + estimated_number_of_users  = (known after apply)
      + id                         = (known after apply)
      + last_modified_date         = (known after apply)
      + mfa_configuration          = "OFF"
      + name                       = "cognito-passwordless-user-pool"
      + sms_verification_message   = (known after apply)
      + tags_all                   = (known after apply)

      + admin_create_user_config {
          + allow_admin_create_user_only = (known after apply)

          + invite_message_template {
              + email_message = (known after apply)
              + email_subject = (known after apply)
              + sms_message   = (known after apply)
            }
        }

      + lambda_config {
          + create_auth_challenge          = "arn:aws:lambda:sa-east-1:357732810582:function:cognito_create_auth_challenge"
          + define_auth_challenge          = "arn:aws:lambda:sa-east-1:357732810582:function:cognito_define_auth_challenge"
          + pre_sign_up                    = "arn:aws:lambda:sa-east-1:357732810582:function:cognito_pre_signup"
          + verify_auth_challenge_response = "arn:aws:lambda:sa-east-1:357732810582:function:cognito_verify_auth_challenge"

          + custom_email_sender {
              + lambda_arn     = (known after apply)
              + lambda_version = (known after apply)
            }

          + custom_sms_sender {
              + lambda_arn     = (known after apply)
              + lambda_version = (known after apply)
            }
        }

      + password_policy {
          + minimum_length                   = (known after apply)
          + require_lowercase                = (known after apply)
          + require_numbers                  = (known after apply)
          + require_symbols                  = (known after apply)
          + require_uppercase                = (known after apply)
          + temporary_password_validity_days = (known after apply)
        }

      + sms_configuration {
          + external_id    = (known after apply)
          + sns_caller_arn = (known after apply)
        }

      + verification_message_template {
          + default_email_option  = (known after apply)
          + email_message         = (known after apply)
          + email_message_by_link = (known after apply)
          + email_subject         = (known after apply)
          + email_subject_by_link = (known after apply)
          + sms_message           = (known after apply)
        }
    }

  # aws_iam_role.cognito_create_auth_challenge_role will be created
  + resource "aws_iam_role" "cognito_create_auth_challenge_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "iam_for_lambda"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.cognito_define_auth_challenge_role will be created
  + resource "aws_iam_role" "cognito_define_auth_challenge_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "iam_for_lambda"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.cognito_pre_signup_role will be created
  + resource "aws_iam_role" "cognito_pre_signup_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "iam_for_lambda"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role.cognito_verify_auth_challenge_role will be created
  + resource "aws_iam_role" "cognito_verify_auth_challenge_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "iam_for_lambda"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_lambda_function.cognito_create_auth_challenge will be created
  + resource "aws_lambda_function" "cognito_create_auth_challenge" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "cognito_create_auth_challenge"
      + handler                        = "bootstrap"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "provided.al2"
      + s3_bucket                      = "cognito-passwordless-signin-lambda-deploys"
      + s3_key                         = "cognito_create_auth_challenge"
      + s3_object_version              = "latest"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_lambda_function.cognito_define_auth_challenge will be created
  + resource "aws_lambda_function" "cognito_define_auth_challenge" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "cognito_define_auth_challenge"
      + handler                        = "bootstrap"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "provided.al2"
      + s3_bucket                      = "cognito-passwordless-signin-lambda-deploys"
      + s3_key                         = "cognito_define_auth_challenge"
      + s3_object_version              = "latest"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_lambda_function.cognito_pre_signup will be created
  + resource "aws_lambda_function" "cognito_pre_signup" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "cognito_pre_signup"
      + handler                        = "bootstrap"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "provided.al2"
      + s3_bucket                      = "cognito-passwordless-signin-lambda-deploys"
      + s3_key                         = "cognito_pre_signup"
      + s3_object_version              = "latest"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_lambda_function.cognito_verify_auth_challenge will be created
  + resource "aws_lambda_function" "cognito_verify_auth_challenge" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "cognito_verify_auth_challenge"
      + handler                        = "bootstrap"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "provided.al2"
      + s3_bucket                      = "cognito-passwordless-signin-lambda-deploys"
      + s3_key                         = "cognito_verify_auth_challenge"
      + s3_object_version              = "latest"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_s3_bucket.cognito_passwordless_signin_lambda_deploys will be created
  + resource "aws_s3_bucket" "cognito_passwordless_signin_lambda_deploys" {
      + acceleration_status                  = (known after apply)
      + acl                                  = (known after apply)
      + arn                                  = (known after apply)
      + bucket                               = "cognito-passwordless-signin-lambda-deploys"
      + bucket_domain_name                   = (known after apply)
      + bucket_regional_domain_name          = (known after apply)
      + cors_rule                            = (known after apply)
      + force_destroy                        = false
      + grant                                = (known after apply)
      + hosted_zone_id                       = (known after apply)
      + id                                   = (known after apply)
      + lifecycle_rule                       = (known after apply)
      + logging                              = (known after apply)
      + object_lock_enabled                  = (known after apply)
      + policy                               = (known after apply)
      + region                               = (known after apply)
      + replication_configuration            = (known after apply)
      + request_payer                        = (known after apply)
      + server_side_encryption_configuration = (known after apply)
      + tags                                 = {
          + "Name" = "cognito-passwordless-signin-lambda-deploys"
        }
      + tags_all                             = {
          + "Name" = "cognito-passwordless-signin-lambda-deploys"
        }
      + versioning                           = (known after apply)
      + website                              = (known after apply)
      + website_domain                       = (known after apply)
      + website_endpoint                     = (known after apply)

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)
          + rule                = (known after apply)
        }
    }

  # aws_s3_bucket_public_access_block.cognito_passwordless_signin_lambda_deploys_public_access_block will be created
  + resource "aws_s3_bucket_public_access_block" "cognito_passwordless_signin_lambda_deploys_public_access_block" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_versioning.cognito_passwordless_signin_lambda_deploys_versioning will be created
  + resource "aws_s3_bucket_versioning" "cognito_passwordless_signin_lambda_deploys_versioning" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # aws_ses_email_identity.ses_email_identity will be created
  + resource "aws_ses_email_identity" "ses_email_identity" {
      + arn = (known after apply)
      + id  = (known after apply)
    }

Plan: 17 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @PoorlyDefinedBehaviour, Action: `pull_request`*